In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [13]:
import pandas as pd
Matrix = ["Essa","Ali","Saad"]
s = pd.Series(Matrix)
s.index = [1,2,3]
print(s)

1    Essa
2     Ali
3    Saad
dtype: object
      0
0  Essa
1   Ali
2  Saad

## Q2: Change indexes to 11, 12, 13.

In [28]:

s.index = [11,12,13]
print(s)

11    Essa
12     Ali
13    Saad
dtype: object

## Q3: Retrieve First and second elements.

In [41]:
print( s.head(2))
#Or
print(s.iloc[:2])

11    Essa
12     Ali
dtype: object
11    Essa
12     Ali
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [53]:

s.loc[14] = 'Saad'
print(s)
s = s.drop_duplicates()
print(s)

11    Essa
12     Ali
13    Saad
0       ss
14    Saad
dtype: object
11    Essa
12     Ali
13    Saad
0       ss
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [59]:

df = pd.DataFrame(columns=["ID","Name","GPA"])
print(df)

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [63]:
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [78]:
edu1 = edu.loc[50:53,['TIME', 'GEO']]
edu1
edu2 = edu[:4]
edu2

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e